[
{
  "model": "recipes.recipe",
  "pk": 1,
  "fields": {
    "name": "Broccoli Pesto & Pancetta Pasta",
    "text": "Method:\r\n\r\nSTEP 1\r\nBring a pan of lightly salted water to the boil. Add the broccoli and boil for 5 mins. Scoop out with a slotted spoon and set aside.\r\n\r\nSTEP 2\r\nPut the pasta in the same pan and cook following pack instructions. Meanwhile, tip the broccoli into a food processor with the pine nuts, basil, garlic, parmesan and oil, and blitz until smooth. Season with black pepper and a little salt (the pancetta is very salty).\r\n\r\nSTEP 3\r\nSet a frying pan over a medium heat and cook the pancetta for 2 mins. Add the tomatoes and cook for 3 mins, or until softened. Toss the pasta with the broccoli pesto, tomatoes and pancetta, and loosen with a splash of pasta water, if needed. Spoon into bowls and serve.",
    "ingredients": "300g head broccoli , broken into florets\r\n300g pasta (we used orecchiette)\r\n1 tbsp pine nuts\r\n1 large bunch of basil\r\n1 large garlic clove\r\n2 tbsp parmesan , finely grated\r\n1 tbsp olive oil\r\n50g smoked pancetta , diced\r\n200g cherry tomatoes , halved",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/broccoli-pesto-pancetta-pasta-75e3452.jpg?quality=90&webp=true&resize=440,400",
    "category": "Low Carbs",
    "time": "Less than 40 mins",
    "created_at": "2021-04-15T14:02:55.158Z",
    "owner": 2,
    "like": []
  }
},
{
  "model": "recipes.recipe",
  "pk": 2,
  "fields": {
    "name": "Turkey Escalopes & Giant Couscous",
    "text": "Method:\r\n\r\nSTEP 1\r\nHeat 2 tbsp of the oil in a saucepan over a medium heat. Fry the onion and aubergine for 15-20 mins, or until softened. Add the garlic and chilli flakes and cook for 1 min more. Tip in the tomatoes and olives and cook for another 10 mins.\r\n\r\nSTEP 2\r\nMeanwhile, heat the grill high. Mix the remaining oil and the lemon zest together, then rub on both sides of the turkey escalopes. Put the escalopes on a baking sheet and grill for 5-6 mins on each side serving until cooked through.\r\n\r\nSTEP 3\r\nCook the couscous following pack instructions, then drain and stir through the tomato sauce along with the basil. Slice the escalopes and serve with the couscous, parmesan and extra basil leaves.",
    "ingredients": "3 tbsp rapeseed oil\r\n1 onion , finely chopped\r\n1 aubergine , cut into 3cm cubes\r\n2 large garlic cloves , crushed\r\n¼ tsp chilli flakes\r\n400g can chopped tomatoes\r\n70g black olives , pitted and sliced\r\n1 lemon , zested\r\n4 turkey escalopes\r\n250g giant couscous\r\n½ small bunch basil , chopped, plus some extra torn leaves to serve\r\n20g parmesan , shaved, to serve",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/turkey-escalopes-giant-couscous-da3c4a8.jpg?quality=90&webp=true&resize=440,400",
    "category": "High Protein",
    "time": "Up to an hour",
    "created_at": "2021-04-15T14:16:32.171Z",
    "owner": 2,
    "like": []
  }
},
{
  "model": "recipes.recipe",
  "pk": 3,
  "fields": {
    "name": "Tomato Penne with Avocado",
    "text": "Method:\r\n\r\nSTEP 1\r\nCook the pasta in salted water for 10-12 mins until al dente. Meanwhile, heat the oil in a medium pan. Add the sliced onion and pepper and fry, stirring frequently for 10 mins until golden. Stir in the garlic and spices, then tip in the tomatoes, half a can of water, the corn and bouillon. Cover and simmer for 15 mins.\r\n\r\nSTEP 2\r\nMeanwhile, toss the avocado with the lime juice and zest, and the finely chopped onion.\r\n\r\nSTEP 3\r\nDrain the penne and toss into the sauce with the coriander. Spoon the pasta into bowls, top with the avocado and scatter over the coriander leaves.",
    "ingredients": "100g wholemeal penne\r\n1 tsp rapeseed oil\r\n1 large onion, sliced, plus 1 tbsp finely chopped\r\n1 orange pepper, deseeded and cut into chunks\r\n2 garlic cloves, grated\r\n2 tsp mild chilli powder\r\n1 tsp ground coriander\r\n½ tsp cumin seeds\r\n400g can chopped tomatoes\r\n196g can sweetcorn in water\r\n1 tsp vegetable bouillon powder\r\n1 avocado, stoned and chopped\r\n1/2 lime, zest and juice\r\nHandful coriander, chopped, plus extra to serve",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/mexican-penne-5cd4efb.jpg?quality=90&webp=true&resize=440,400",
    "category": "Vegetarian",
    "time": "Less than 20 mins",
    "created_at": "2021-04-15T14:20:40.438Z",
    "owner": 2,
    "like": []
  }
},
{
  "model": "recipes.recipe",
  "pk": 4,
  "fields": {
    "name": "Charred Cauliflower, Lemon & Caper Orzo",
    "text": "Method:\r\n\r\nSTEP 1\r\nHeat the grill to high. Toss the cauliflower with half the oil and some seasoning. Tip onto a baking tray and grill for 15-20 mins until golden, charred, and tender all the way through.\r\n\r\nSTEP 2\r\nMeanwhile, cook the orzo in a pan of boiling salted water for 8 mins, or until al dente. Drain.\r\n\r\nSTEP 3\r\nHeat the remaining oil in a frying pan and sizzle the capers and garlic until golden. Stir in the orzo, cauliflower, lemon zest and juice and the stock. Bubble for 1 min, then spoon half into a bowl and top with the rocket. Leave the leftovers to cool for the lunchbox, see tip below.",
    "ingredients": "½ cauliflower , broken into florets, stalk chopped into cubes\r\n2 tsp olive oil\r\n100g orzo\r\n2 tsp capers , drained and rinsed\r\n1 small garlic clove , sliced', '½ lemon , zested and juiced\r\n100ml low-salt vegetable stock (check it’s vegan, if required)\r\nhandful of rocket leaves , to serve",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/cauliflower_orzo-3912eb0.jpg?quality=90&webp=true&resize=440,400",
    "category": "Vegan",
    "time": "Less than 20 mins",
    "created_at": "2021-04-15T14:24:21.554Z",
    "owner": 2,
    "like": []
  }
},
{
  "model": "recipes.recipe",
  "pk": 5,
  "fields": {
    "name": "Salsa Verde Salmon with Smashed Chickpea Salad",
    "text": "Method:\r\n\r\nSTEP 1\r\nHeat the grill to high. Whisk 1 tsp of the oil with the orange zest, a splash of the juice, lots of black pepper and a small pinch of salt. Put the salmon, skin-side down, on a non-stick baking tray and pour over the marinade. Leave to marinate at room temperature while you make the salsa.\r\n\r\nSTEP 2\r\nPut the parsley, mustard, half the shallot, the vinegar, 1 tsp oil, and the remaining orange juice in a small food processor and blitz to a thick sauce, adding a splash of water to loosen if needed.\r\n\r\nSTEP 3\r\nHeat the remaining oil in a frying pan and fry the remaining shallot for 5 mins. Stir in the chickpeas and some seasoning, turn up the heat and stir until the chickpeas are just starting to crisp. Mash roughly with a potato masher and stir in the roasted peppers and kale. Add a splash of water and cover with a lid until the kale is wilted. Keep warm over a low heat.\r\n\r\nSTEP 4\r\nGrill the salmon for 4-6 mins, or until cooked to your liking. Spoon half the chickpeas onto a plate, top with a salmon fillet (leaving the skin behind if you like), and spoon over some of the salsa verde. Leave the remaining salmon fillet to cool to use in the lunchbox, see tip below.",
    "ingredients": "3 tsp olive oil\r\n1 orange , zested and juiced\r\n2 skin-on salmon fillets\r\nSmall bunch of parsley (including stalks), finely chopped\r\n½ tbsp Dijon mustard\r\n1 shallot or 1/2 small red onion, finely chopped\r\n½ tbsp red wine vinegar\r\n400g can chickpeas , drained and rinsed\r\n2 roasted red peppers from a jar, drained and chopped\r\n50g kale",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/salsa-verde-salmon-with-smashed-chickpea-salad-447f6cc.jpg?quality=90&webp=true&resize=440,400",
    "category": "Low Carbs",
    "time": "Less than 40 mins",
    "created_at": "2021-04-15T14:34:09.775Z",
    "owner": 2,
    "like": []
  }
},
{
  "model": "recipes.recipe",
  "pk": 6,
  "fields": {
    "name": "South American-style Quinoa with Fried Eggs",
    "text": "Method:\r\n\r\nSTEP 1\r\nPut the quinoa in a small pan with 250ml water and bring to the boil. Reduce the heat to low, cover and gently simmer for 15-20 mins, stirring occasionally until most of the water has been absorbed and the grains have doubled in size (if there’s any water left in the pan, drain well).\r\n\r\nSTEP 2\r\nTip into a bowl and stir through the beans, spices, lime zest and juice and vinegar. Stir well, then add the tomatoes, avocado, coriander and onion, and spoon onto plates.\r\n\r\nSTEP 3\r\nHeat a drop of oil in a non-stick frying pan and fry the eggs until the whites are set with a crispy edge and the yolk is runny. Serve the quinoa topped with the eggs.:",
    "ingredients": "75g quinoa\r\n400g can black beans , drained\r\n½ tsp ground cumin\r\n½ tsp ground coriander\r\n1 lime , zested and juiced, plus extra wedges to serve\r\n1 tsp cider vinegar\r\n160g cherry tomatoes , halved\r\n1 small avocado , stoned, peeled and roughly chopped\r\n2 tbsp finely chopped coriander\r\n3 spring onions or ½ small red onion, finely chopped\r\nRapeseed oil , for frying\r\n2 medium eggs",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/south-american-style-quinoa-with-fried-eggs-d59a1b7.jpg?quality=90&webp=true&resize=440,400",
    "category": "Vegetarian",
    "time": "Less than 20 mins",
    "created_at": "2021-04-15T14:42:07.575Z",
    "owner": 2,
    "like": []
  }
},
{
  "model": "recipes.recipe",
  "pk": 7,
  "fields": {
    "name": "Chicken & Sweetcorn Tacos",
    "text": "Method:\r\n\r\nSTEP 1\r\nCombine the flour with half the oil and a small pinch of salt in a bowl. Pour over 125-150ml warm water, then bring together into a soft dough with your hands. Cut into six equal pieces, then cut four of the pieces in half again, so you have eight small pieces and two large. Roll all the pieces out on a floured work surface until they’re as thin as you can get them.\r\n\r\nSTEP 2\r\nHeat a dry frying pan over a medium-high heat and cook the small and large tortillas for 2-3 mins on each side until golden and toasted (do this one at a time). Leave the large tortillas to cool, then cover and reserve for use in the lunchboxes (see tip below). Keep the small tortillas warm in foil.\r\n\r\nSTEP 3\r\nSprinkle the taco seasoning over the chicken in a bowl, and toss to combine. Toss the cabbage with the lime juice, half the coriander and some seasoning in another bowl, then leave to pickle.\r\n\r\nSTEP 4\r\nMeanwhile, heat two frying pans over a high heat. Divide the remaining oil between the pans and fry the sweetcorn and a pinch of salt until sizzling and turning golden, stirring occasionally – you want the sweetcorn to char slightly, as this adds flavour, so you may need to leave it to cook undisturbed for a bit. While the sweetcorn cooks and chars, fry the chicken in the larger pan until cooked through and golden (you may need to do this in batches).\r\n\r\nSTEP 5\r\nTip the black beans and garlic into the sweetcorn and stir to warm through. Squeeze over two of the lime wedges.\r\n\r\nSTEP 6\r\nReserve two spoonfuls each of the chicken (about 1 chicken breast) and sweetcorn mix for use in the lunchboxes (see tip, below), then serve the rest in bowls alongside the cabbage, yogurt, lime wedges, remaining coriander, chilli sauce and tortillas for everyone to dig into.",
    "ingredients": "250g plain flour , plus extra for dusting\r\n2 tbsp rapeseed oil\r\n2 tbsp taco or fajita seasoning (see tip, below)\r\n5-6 skinless chicken breasts, sliced\r\n¼ red cabbage , finely shredded\r\n3 limes , 1 juiced, 2 cut into wedges\r\nSmall bunch of coriander , chopped\r\n4 sweetcorn cob , kernels sliced off, or 400 g frozen sweetcorn\r\n400g can black beans , drained and rinsed\r\n2 garlic cloves , crushed\r\n4 tbsp fat-free yogurt , to serve\r\nChilli sauce , to serve",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chicken-sweetcorn-tacos-f01abbf.jpg?quality=90&webp=true&resize=300,272",
    "category": "Low Carbs",
    "time": "Up to an hour",
    "created_at": "2021-04-19T21:30:58.968Z",
    "owner": 1,
    "like": []
  }
},
{
  "model": "recipes.recipe",
  "pk": 8,
  "fields": {
    "name": "Pesto Chicken Salad",
    "text": "Method:\r\n\r\nSTEP 1\r\nPut the couscous in a large heatproof bowl and cover with 100ml boiling water. Stir in 1 tbsp pesto. Cover and leave for 8 mins. \r\n\r\nSTEP 2\r\nFluff the couscous with a fork, then stir in the rest of the pesto, the yogurt and some seasoning. Toss in the chicken, basil, cucumber and tomatoes.\r\n\r\nSTEP 3\r\nSpoon the couscous mix into the lettuce leaves and eat with your fingers, or serve over the lettuce like a salad. Scatter over the pine nuts and more basil before serving.",
    "ingredients": "50g couscous\r\n2 tbsp pesto\r\n2 tbsp fat-free yogurt\r\n2 cooked skinless chicken breasts , shredded, or 200g leftover roast chicken, shredded\r\n½ small bunch of basil , leaves picked and torn, plus a few small leaves to serve\r\n½ cucumber , chopped\r\n2 sundried tomatoes in oil, drained and sliced\r\n2 Little Gem lettuces , leaves separated\r\n2 tsp toasted pine nuts",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/pesto-chicken-salad-a752309.jpg?quality=90&webp=true&resize=300,272",
    "category": "Low Carbs",
    "time": "Less than 20 mins",
    "created_at": "2021-04-20T20:08:53.409Z",
    "owner": 1,
    "like": []
  }
},
{
  "model": "recipes.recipe",
  "pk": 9,
  "fields": {
    "name": "Spicy Peanut Pies",
    "text": "Method:\r\n\r\nSTEP 1\r\nHeat oven to 200C, 180C fan, gas 6. Steam the potatoes for the mash for 20 mins until tender, adding the cauliflower to the steamer after 10 mins. Heat the oil for the filling in a non-stick pan, add the ginger and chilli and stir around the pan until starting to soften. Stir in the dried spices then add the leeks and peppers and cook, stirring frequently, until they are softening. \r\n\r\nSTEP 2\r\nTip in the tomatoes and tomato purée with the cauliflower and 150ml water, and the bouillon. Cover and simmer for 10 mins. \r\n\r\nSTEP 3\r\nStir the peanut butter with 100ml water to loosen the consistency, then stir into stew and cook 5 mins more. Spoon equally into 25cm by 18cm pie dishes.\r\n\r\nSTEP 4\r\nFor the mash, tip the beans into a bowl, add the coriander and chilli powder and mash well. Add the potatoes and roughly mash into the beans so it still has a little texture. Pile on top of the filling in the pie dishes and carefully spread over the filling to enclose it.\r\n\r\nSTEP 5\r\nBake one for 35 mins and chill the other for another day. It will keep for 3 days. Reheat the remaining pie as above, adding an extra 15 mins as you're cooking it from cold.",
    "ingredients": "For the mash:\r\n\r\n500g potatoes , peeled and chopped\r\n2 x 400g cans cannellini beans , drained\r\n3 tbsp chopped fresh coriander\r\n1 tsp chilli powder\r\n\r\nFor the filling:\r\n\r\n320g cauliflower , cut into small florets\r\n2 tsp rapeseed oil\r\n2 tbsp finely chopped ginger\r\n1 red chilli , seeded unless you like it very spicy\r\n2 tbsp cumin seeds\r\n2 tbsp ground coriander\r\n1 tsp chilli powder\r\n400g leeks , thickly sliced\r\n1 red pepper , deseeded and diced\r\n1 green pepper , deseeded and diced\r\n400g can chopped tomatoes\r\n2 tbsp tomato purée\r\n2 tsp vegetable bouillon\r\n85g chunky peanut butter (with no sugar or palm oil)",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/spicy-peanut-pies-cropped-in-2172ddb.jpg?quality=90&webp=true&resize=300,272",
    "category": "Vegetarian",
    "time": "Up to an hour",
    "created_at": "2021-04-20T20:11:39.809Z",
    "owner": 1,
    "like": []
  }
},
{
  "model": "recipes.recipe",
  "pk": 10,
  "fields": {
    "name": "Satay Tofu Skewers with Garlic & Ginger Pak Choi",
    "text": "Method:\r\n\r\nSTEP 1\r\nMix the peanut butter, soy, chilli and lime juice together with 50ml water. Pour half into a roasting tin, add the chunks of tofu and stir to coat. Leave to marinate for 30 mins if you have time, then thread onto four skewers and put on a baking tray.\r\n\r\nSTEP 2\r\nHeat the grill to its highest setting. Grill the tofu for 4 mins on each side until nicely browned and crisp. Meanwhile, heat the oil in a frying pan or wok. Add the garlic and ginger and sizzle for 1 min or so, then tip in the pak choi and cook for about 3 mins until wilted.\r\n\r\nSTEP 3\r\nDivide the pak choi and skewers between plates. Sprinkle over the peanuts, drizzle over the remaining sauce and serve with lime wedges for squeezing over.",
    "ingredients": "3 tbsp smooth peanut butter\r\n1 tsp light soy sauce\r\npinch of chilli flakes\r\n1 lime , ½ juiced, ½ cut into wedges\r\n200g firm tofu (see tip, below), cut into chunks\r\n1 tbsp rapeseed oil\r\n1 garlic clove , sliced\r\nsmall piece of ginger , sliced\r\n200g pak choi , leaves separated\r\n1 tbsp roasted peanuts\r\n\r\nYou will need:\r\n\r\n4 skewers (soak in cold water for 20 mins if they’re wooden)",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/satay-tofu-skewers-with-garlic-ginger-pak-choi-a047e9c.jpg?quality=90&webp=true&resize=300,272",
    "category": "Vegan",
    "time": "Less than 20 mins",
    "created_at": "2021-04-20T20:13:56.970Z",
    "owner": 1,
    "like": []
  }
}
]
