[
{
  "model": "articles.article",
  "pk": 2,
  "fields": {
    "name": "The 5 Best Air Fryer Recipes That Revamp Boring Chicken",
    "image": [
      "https://img.livestrong.com/630x/clsd/getty/55dbea8772c245d4a72a1206e548c935.jpg?type=webp", 
      "https://img.livestrong.com/630x/media-storage/contentlab-data/3/31/9a9845bd64a146a78616fbb1a3e131c6.jpeg?type=webp", 
      "https://img.livestrong.com/630x/media-storage/contentlab-data/4/13/1311726c849c42178744c83eb15e4b6c.png?type=webp", 
      "https://img.livestrong.com/630x/media-storage/contentlab-data/3/31/3baaf6f05d904212bf07cc95518583f8.jpg?type=webp", 
      "https://img.livestrong.com/630x/media-storage/contentlab-data/3/31/b9f48075d67147638ac620c56831251a.jpg?type=webp"
    ],
    "text": "Many of us fall into one of two categories: Air fryer-obsessed or desperately wishing we had one because there's so much to love about it. After all, the air fryer is relatively easy to use and can recreate that deep-fried texture and flavor we hate to admit we love.\r\n\r\nIf you're not familiar with the air fryer, let us brief you: It's similar to a convection oven and uses a circulation of hot air to cook. The hot air takes the place of the vat of oil you'd find in a deep frier, which is one of the reasons users are falling in love with this nifty machine. Without the need to submerge food in oil, you cut down on both calories and fat in your dish.\r\nNow that we've convinced you that the air fryer is the next best thing to hit kitchen counters, we've rounded up 5 easy air fryer chicken recipes to make in minutes.\r\n\r\n1. Asian-Inspired Glazed Air Fryer Chicken Thighs\r\n\r\n​361 calories​\r\n​46 grams of protein​\r\n\r\nFor a burst of flavor, try adding a glaze or marinade to your air-fried chicken, like this Asian-inspired recipe calls for. Because this glaze includes soy sauce, which is high in sodium, Nicole Rodriguez, RDN, recommends swapping for liquid coconut aminos, which has 60 milligrams of sodium per serving instead of the 500 milligrams in soy sauce.\r\n\r\n2. Air Fryer Grilled Chicken Kebabs\r\n\r\n​136 calories​\r\n​23 grams of protein​\r\n\r\nWe often pigeonhole kebabs to the summer season, thanks to the grill, but air frying allows us to make this delicious meal no matter what the weather's like outside. \"Kebabs are the perfect vehicle to add more plants into our diets,\" Rodriguez says. After all, you can skewer any veggie — or fruit! — for a perfect lunch or dinner. \"Just skip pre-made seasonings and prepare your own with dried spices to reduce the overall sodium content.\"\r\n\r\n3. Air Fryer General Tso's Chicken\r\n\r\n​397 calories​\r\n​46 grams of protein​\r\n\r\nWhen the Chinese takeout cravings hit, consider making this healthier version instead. \"For about a quarter of the calories and a tenth of the fat of the original, this is a winner, winner chicken dinner,\" Rodriguez says. To make it a well-balanced meal, serve with a nutrient-dense green vegetable on the side like bok choy or broccoli.\r\n\r\n4. Air Fryer Chicken Fajitas\r\n\r\n​214 calories​\r\n​26 grams of protein​\r\n\r\nInstead of babysitting your chicken and peppers over a stove, simply toss them in the air fryer and you've got a ready-made meal in minutes. \"Serve alongside corn tortillas, which are lower in sodium and carbs [than flour tortillas] and top with plain Greek yogurt instead of sour cream,\" Rodriguez suggests.\r\n\r\n5. Air Fryer Chicken Parmesan\r\n\r\n​541 calories​\r\n​47 grams of protein​\r\n\r\nEven though this Italian-American favorite is a better-for-you option when air fried, Rodriguez warns that it's full of sodium. \"Keep the cheese and substitute no-salt-added canned tomato sauce for the marinara,\" Rodriguez says. And if you're watching your carb intake, skip the pasta and serve alongside vegetables.",
    "author": "By Andrea Jordan",
    "created_at": "2021-04-15T14:20:53.786Z",
    "owner": 1
  }
},
{
  "model": "articles.article",
  "pk": 3,
  "fields": {
    "name": "4 Mistakes to Avoid When Eating Chocolate for Weight Loss",
    "image": [
      "https://img.livestrong.com/630x/cme-data/getty%2F90b69fc784714bc89531a6b5d68587d6.jpg?type=webp"
    ],
    "text": "That's right — eating chocolate could help you lose weight. It's not a magic bullet (sorry!), but there are few ways that a little chocolate may encourage your weight-loss goals.\r\n\r\n\"Adding chocolate [to your diet] can make lifestyle changes feel more realistic, fun and doable long term,\" says DJ Blatner, RDN and author of ​The Superfood Swap​.\r\n\r\nIndeed, chocolate may boost your mood, per a March 2018 study in ​Planta Medica​. Researchers think the benefit comes from the good-for-you polyphenols in the sweet stuff.\r\n\r\n\"When you are in a better mood, you are likely to do more loving, healthy acts of self-care like exercise and making nourishing meals,\" Blatner says.\r\n\r\nWhat's more, chocolate might help lower stress, says an October 2014 study in the ​International Journal of Health Sciences​. When students ate dark or milk chocolate daily for two weeks (compared to white chocolate), their perceived stress improved — particularly in people assigned female at birth.\r\n\r\nWhen you're stressed, your levels of cortisol (the \"stress hormone\") are higher and, over time, that can lead to weight gain.\r\n\r\n\"Plus, less stress means less stress-eating,\" adds Blatner.\r\n\r\nThat said, not all chocolate-eating is helpful if you're trying to lose weight.\r\n\r\nHere are four mistakes you might be making when it comes to chocolate and losing weight.\r\n\r\n\r\nMistake 1: Taking an 'All or Nothing' Approach\r\n\r\nFor some people, complete abstinence is the way to go. But for others — and there's science to support this — an all-or-nothing approach could backfire.\r\n\r\n\"What I see most in my practice is that when people want to lose weight, often it is the strict rules — cutting out food groups, removing all of the foods they love — that set them up to fail,\" Blatner says.\r\n\r\nInstead, a little indulgence here and there could help you avoid a binge. That's because depriving yourself can spark cravings, according to a June 2020 review in ​Current Nutrition Reports​, and that could eventually lead to eating more of the exact food or foods you're trying to avoid.\r\n\r\nIn the review, researchers found that across multiple studies, when people cut out food groups (carbs, chocolate, salty foods), they then craved that exact food group after a few days or a week. (In the long-term, however — think: three months to two years — studies suggest the cravings eventually go away.)\r\n\r\n\r\nMistake 2: Limiting Your Chocolate Treat to After Dinner Only\r\n\r\nThis might sound slightly unconventional, but hear us out.\r\n\r\nDieters with obesity were assigned to follow one of two diets: a low-carb breakfast or a high-protein, high-carb breakfast that included a dessert. After four months, both groups successfully lost weight — around 30 pounds, according to the March 2012 study in ​Steroids​.\r\n\r\nThen, during the following four months — the \"weight maintenance\" phase — the low-carb breakfast eaters re-gained some of the weight they lost while the dieters who ate dessert with breakfast lost, on average, an additional 15 pounds.\r\n\r\nThis is just one study, so we can't say after breakfast is the \"right\" time for chocolate, but we can say it's worth thinking outside the box (of chocolates...sorry, we had to!).\r\n\r\nPlus, there's good evidence that eating a bigger breakfast and smaller dinner can help with weight loss.\r\n\r\n\r\nMistake 3: Baking With Chocolate\r\n\r\nThis is where the delivery vehicle — and the other passengers alongside chocolate (oh hey, sugar and butter) — is more important than the chocolate.\r\n\r\nYes, we've established that indulging in moderation fits into a weight-loss diet. But if chocolate is what you desire, just go with a piece of dark chocolate. That's because baked items like cakes, cookies and pies are one of the biggest sources of added sugars in the American diet, according to the American Heart Association. And too much added sugar in your diet can cause weight gain and up your risk of obesity, per the AHA.\r\n\r\n\r\nMistake 4: Choosing Milk Chocolate Over Dark Chocolate\r\n\r\n\"Dark chocolate usually has less sugar and more beneficial flavonoids than its milk chocolate cousin,\" says Blatner.\r\n\r\nFlavonoids are anti-inflammatory antioxidants that might help with stress. And less sugar is better for weight loss, as we noted above.\r\n\r\nDark chocolate may also help you feel satisfied with less.\r\n\r\n\"Researchers from the University of Copenhagen found dark chocolate to be more filling than milk chocolate,\" says Blatner. The study was quite small, but when participants ended a 12-hour fast with dark chocolate versus milk chocolate, they went on to eat less pizza two and a half hours later.\r\n\r\nHow to Eat Chocolate for Weight Loss\r\n\r\nIf you want to keep chocolate in your life while following a weight-loss diet, aim to eat no more than about 1 ounce a day of dark chocolate, and find ways to savor that ounce, advises Blatner. Here are a few of her mindful eating ideas:\r\n\r\n* Eat your dark chocolate from a cute little plate and eat it while seated to make it more mindful than just eating it while watching TV or standing in the kitchen.\r\n\r\n* Sip a cup of mint tea with your dark chocolate to make it feel more special, like an evening ritual.\r\n\r\n* Bulk up your dark chocolate treat with some fresh berries on the side. Dark chocolate plus berries is the perfect pairing.\r\n\r\n* Don't get bored, make bark. Melt the dark chocolate, pour it on parchment, sprinkle add-ons like cayenne, unsweetened coconut flakes or puffed brown rice cereal, freeze it and enjoy. (I call this making your own mini DIY candy bar!)",
    "author": "By Brierley Horton, MS, RD",
    "created_at": "2021-04-15T14:32:36.442Z",
    "owner": 1
  }
},
{
  "model": "articles.article",
  "pk": 4,
  "fields": {
    "name": "The Ultimate Guide to the Calories in Coffee",
    "image": [
      "https://img.livestrong.com/630x/cme-data/getty%2F2280b532629746528c2a7815d832fe92.jpg?type=webp"
    ],
    "text": "A morning cup of coffee is more than just emotionally pleasing — it's also a relatively healthy way to start the day, given that it's low in calories and comes with additional health perks.\r\n\r\nConsider coffee's health benefits: The brew is linked to a lower risk of several diseases, from type 2 diabetes to depression, per the Cleveland Clinic.\r\n\r\nBut milk, cream and sugar can change the nutrition profile of your cup of coffee pretty quickly. Keep scrolling to learn about the number of calories, nutrition info and amount of caffeine in coffee and popular add-ins.\r\n\r\nCalories in Coffee and Nutrition Information\r\n\r\nFrom flat whites in Australia to espresso in Italy, there are about as many types of and ways to drink coffee as there are people who drink it around the world. But your average cup (6 ounces) of regular black coffee offers the following calories and nutrition info, according to the USDA:\r\n\r\n​* Calories:​ 2\r\n​* Total Fat:​ 0 g, 0% Daily Value (DV)\r\n​* Cholesterol:​ 0 mg, 0% DV\r\n​* Sodium:​ 3.6 mg, 0% DV\r\n​* Total Carbohydrates:​ 0 g, 0% DV\r\n​* Dietary fiber:​ 0 g, 0% DV\r\n​* Sugar:​ 0 g\r\n​* Protein:​ 0.2 g, 0% DV\r\n​* Calcium:​ 3.6 mg, 0% DV\r\n​* Potassium:​ 87.2 mg, 2% DV\r\n​* Phosphorus:​ 5.3 mg, 0% DV\r\n\r\nThe amount of caffeine in a cup of coffee varies. So does the size: A \"cup\" of coffee may be defined as anything from 6 to 8 ounces (the actual size of a cup measurement) — and, of course, sizing will vary from one café to another.\r\n\r\nOn average, an 8-ounce cup contains 95 milligrams of caffeine, per the Harvard T.H. Chan School of Public Health. But that's just an average: The same amount of coffee from Starbucks (brewed with Pike's Blend) clocks in at 155 milligrams of caffeine, per the Center for Science in the Public Interest.\r\n\r\nWarning\r\n\r\nMany of us drink coffee specifically for its caffeine content, but caffeine can cause unpleasant side effects, such as anxiety, sleep disruption, restlessness and a fast heart rate, per the U.S. National Library of Medicine. On the flip side, if you’re in the habit of enjoying caffeinated coffee, quitting that daily habit — especially cold turkey — can lead to headaches, irritability and other withdrawal symptoms.\r\n\r\nCoffee Blends\r\n\r\nSpecific brands and blends will have different values for calories and nutrition info. Scroll on for the calorie counts and nutrition facts for common coffee brands and varieties.\r\n\r\nCoffee With Semi-Skimmed, Low-Fat or Nonfat Milk\r\n\r\nAdd a dash of milk to your cup of java and you'll change the drink's nutritional makeup.\r\n\r\nSkim milk — or skimmed milk, as it's known in the United Kingdom — is whole milk with the fat removed. Semi-skimmed milk — which is common in the U.K. — has a fat content of 1.7 percent, according to the Dairy Council for Northern Ireland. Think of semi-skimmed milk as an in-between option, with half the fat content of whole milk.\r\n\r\nSimilar varieties of low-fat milk in the United States have either 1 or 2 percent fat content levels.\r\nHere's a look at the nutritional breakdown of your cup of coffee if you add 1 fluid ounce (2 tablespoons) of 2 percent milk to your 6-ounce cup, according to the USDA:\r\n\r\n​Calories:​ 17\r\n​Total Fat:​ 0.6 g, 1% DV\r\n​Saturated Fat:​ 0.4 g, 2% DV\r\n​Cholesterol:​ 2.4 mg, 1% DV\r\n​Sodium:​ 15.9 mg, 1% DV\r\n​Total Carbohydrates:​ 1.5 g, 0% DV\r\n​Dietary fiber:​ 0 g, 0% DV\r\n​Sugar:​ 1.5 g\r\n​Protein:​ 1.2 g, 2% DV\r\n​Vitamin C:​ 0.1 mg, 0% DV\r\n​Vitamin D:​ 0.4 μg, 2% DV\r\n​Calcium:​ 40.2 mg, 3% DV\r\n​Potassium:​ 129.9 mg, 3% DV\r\n​Phosphorus:​ 33.4 mg, 3% DV\r\n\r\nUsing 2 percent milk will deliver about the same calories and nutrition as semi-skimmed milk. You'll take in fewer calories if you choose to use 1 percent milk. Here's the nutritional breakdown for adding 1 fluid ounce (2 tablespoons) of 1 percent milk to your 6-ounce cup, per the USDA:\r\n\r\n​Calories:​ 15\r\n​Total Fat:​ 0.3 g, 0% DV\r\n​Saturated Fat:​ 0.2 g, 1% DV\r\n​Cholesterol:​ 1.5 mg, 1% DV\r\n​Sodium:​ 17 mg, 1% DV\r\n​Total Carbohydrates:​ 1.5 g, 1% DV\r\n​Dietary fiber:​ 0 g, 0% DV\r\n​Sugar:​ 1.6 g\r\n​Protein:​ 1.2 g, 2% DV\r\n​Vitamin D:​ 0.4 μg, 2% DV\r\n​Calcium:​ 41.7 mg, 3% DV\r\n​Potassium:​ 133 mg, 3% DV\r\n​Phosphorus:​ 34.3 mg, 3% DV\r\n\r\nMocha Coffee\r\n\r\nAdd steamed milk and chocolate to your everyday cup of coffee, and you've got yourself a mocha. It's a delicious option, but a mocha can easily become packed with sugar and calories, particularly if it's topped with whipped cream.\r\n\r\nMany versions of mocha coffee are available, including hot and iced commercially prepared varieties that have low-fat or nonfat milk ingredients and instant powders for use at home.\r\n\r\nMocha-flavored instant powders are convenient. To prepare, all you have to do is add hot water. An 8-ounce mocha has the following calories and nutritional information, per the USDA:\r\n\r\n​Calories:​ 14\r\n​Total Fat:​ 0.6g, 1% DV\r\n​Saturated fat:​ 0.2g, 1% DV\r\n​Cholesterol:​ 0 mg, 0% DV\r\n​Sodium:​ 9 mg, 0% DV\r\n​Total Carbohydrates:​ 2 g, 1% DV\r\n​Dietary fiber:​ 0 g, 0% DV\r\n​Sugar:​ 1.3 g\r\n​Protein:​ 0.1 g, 0% DV\r\n​Calcium:​ 6.8 mg, 1% DV\r\n​Potassium:​ 27 mg, 1% DV\r\n​Phosphorus:​ 7.4 mg, 1% DV\r\n\r\nA medium mocha latte from Dunkin' Donuts (with no sweetener and skim milk) has the following calories and nutrition:\r\n\r\n​Calories:​ 250\r\n​Total Fat:​ 4 g, 5% DV\r\n​Saturated fat:​ 0.5 g, 3% DV\r\n​Trans fat:​ 0 g\r\n​Cholesterol:​ 0 g, 0% DV\r\n​Sodium:​ 160 mg, 7% DV\r\n​Total Carbohydrates:​ 53 g, 19% DV\r\n​Dietary fiber:​ 4 g, 14% DV\r\n​Sugar:​ 33 g\r\n​Added sugar:​ 27 g, 54% DV\r\n​Protein:​ 3 g, 6% DV\r\n​Vitamin D:​ 4 mcg, 20% DV\r\n​Calcium:​ 391 mg, 30% DV\r\n​Iron:​ 1 mg, 6% DV\r\n​Potassium:​ 496 mg, 10% DV\r\n\r\n\r\nCafé Coffee\r\n\r\nYou'll find many decadent beverage options at coffee shops that involve espresso, blenders and all manner of tools and blends that are likely more complex than what you can manage at home.\r\nStarbucks Matcha Green Tea Crème Frappuccino\r\n\r\nStarbucks' signature Frappuccino blended beverages are available in numerous inventive flavor combinations, like the previously popular Starbucks Tazo Green Tea Frappuccino, which is no longer available. The latest green tea Frappuccino, the Matcha Green Tea Crème Frappuccino, mixes matcha powder together with milk and ice. By default, this frappuccino is topped with sweetened whipped cream.\r\n\r\nThe concoction is available in Starbucks' three sizes: tall, grande and venti. A grande (16 ounces) Matcha Green Tea Crème Frappuccino made with whole milk, but without whipped cream, has the following calories and nutritional information:\r\n\r\n​Calories:​ 410\r\n​Calories from fat:​ 110\r\n​Total Fat:​ 15 g, 19% DV\r\n​Saturated fat:​ 9 g, 45% DV\r\n​Trans fat:​ 0.5 g\r\n​Cholesterol:​ 50 mg, 17% DV\r\n​Sodium:​ 240 mg, 10% DV\r\n​Total Carbohydrates:​ 63 g, 23% DV\r\n​Dietary fiber:​ 1 g, 4% DV\r\n​Sugar:​ 62 g\r\n​Protein:​ 6 g, 12% DV\r\n​Caffeine:​ 70 mg\r\n\r\nThis drink is very customizable: You can add whipped cream, use a wide range of dairy and non-dairy milks and adjust the number of pumps of syrup and scoops of matcha tea powder. Changing any of these elements will also adjust the nutritional value of the beverage.\r\n\r\nIn terms of calories, a frappuccino is very similar to a milkshake. An 18-ounce milkshake (just slightly larger than a grande frappuccino) from one popular ice cream franchise has 458 calories, per the USDA.\r\nSummary\r\n\r\nWhile different brands and blends vary, single servings of most types of regular coffee (without any cream or sugar added) have approximately:\r\n\r\n2-4 calories\r\n0 g fat\r\n0 g carbs\r\n0 g sugar\r\n0 g protein\r\n95 to 155 mg caffeine",
    "author": "by  Madeleine H. Burry",
    "created_at": "2021-04-15T14:46:25.951Z",
    "owner": 1
  }
},
{
  "model": "articles.article",
  "pk": 5,
  "fields": {
    "name": "How to Find the Weight-Loss Program That Will Work for You",
    "image": [
      "https://img.livestrong.com/630x/clsd/8/8/e07809d7687e4c50a5bfda9778de15a0.jpg?type=webp",
      "https://img.livestrong.com/630x/clsd/8/7/5bcdea3c13bc41cbba8564a552125164.jpg?type=webp",
      "https://img.livestrong.com/630x/clsd/getty/b6788cb993874f3b8e128c9d940e6c54.jpg?type=webp",
      "https://img.livestrong.com/630x/clsd/8/7/6c9627672b2c4aed956c23cf090a265d.jpg?type=webp",
      "https://img.livestrong.com/630x/clsd/8/7/efb695eb75ee49d387689cdc0af2b3d7.jpg?type=webp"
    ],
    "text": "Keeping up with all of the weight-loss programs out there is no easy task. From Weight Watchers to Beachbody to Noom, each one seems to promise impressive results along with the guarantee that it will be the last diet you'll ever need.\r\n\r\nThe truth? Some of these plans are rooted in science, while some are based on, well, not much at all. So how do you choose the best program — aka one that will actually work for you and isn't a total scam? Here's what you should know.\r\n\r\nWhat's the Difference Between a Weight-Loss Program and a Diet?\r\n\r\nFirst, let's clarify what we mean when we say weight-loss program, and how these differ from your average diet. The key word here is \"program.\" We're talking about something more comprehensive than just a guideline on what to eat, like the low-carb keto diet or high-protein paleo plan.\r\n\r\nWeight-loss programs typically have a company behind them and require some type of subscription or membership. Most of them go beyond telling you what to eat and aim to provide everything you need to lose weight, from counseling to recipes to exercise recommendations.\r\n\r\nIn short, a weight-loss program should give you much more than a diet. A good program will encourage you to shift to a healthier lifestyle, including daily physical activity, and it may also offer access to nutrition experts who can lend support and answer your questions.\r\n\r\nHow to Tell if a Weight-Loss Program Is Legit\r\n\r\nBefore you can narrow down the field of contenders, you first need to identify which programs are trustworthy and effective — and which might do more harm than good. It can be tricky to tell the real deals from the fakes when that stunning before-and-after photo pops up in your Instagram feed or you read a compelling testimonial about someone who finally hit that dream number on the scale. Fortunately, there are several ways to know if a program will really deliver on its promises. The first clue? It should prioritize getting healthy over getting thin.\r\n\r\nThe Deal With Weight Watchers\r\n\r\nWeight Watchers, which recently rebranded as WW, has been helping people lose weight for more than 50 years and is often named among the best commercial diet plans. The program assigns points to foods based on their nutritional value, and participants are allotted a daily points budget based on their starting weight and how much they want to lose.\r\nWhile research has found Weight Watchers to be effective and the program is especially lauded for the support system it offers its members, it does have a few features that aren't ideal for some people, including the cost of the more structured plans.\r\n\r\nAll About the Mayo Clinic Diet\r\n\r\nYou may have seen \"Mayo Clinic\" paired with any number of fad diets, including those that encourage followers to eat just grapefruit or consume only cabbage soup in order to drop pounds. But don't confuse these posers with the real Mayo Clinic Diet, which is grounded in science and backed by the organization's doctors and other experts.\r\nAs you might expect from such a reputable source, this program is balanced, takes a slow-and-steady approach to weight loss and helps members maintain when they're done losing. But the program also requires a level of personal responsibility that might deter some people from hopping on board.\r\n\r\nWhat to Know About Jenny Craig\r\n\r\nLike Weight Watchers, Jenny Craig has been around for decades, and it often appears on lists of the best commercial diet plans. What sets the program apart from many others, though, is that it provides members with pre-made frozen meals and snacks. Beyond adding a bit of fresh produce, subscribers don't even need to go to the grocery store or cook while following the plan.\r\nWhile this approach is certainly convenient, it doesn't work for everyone's lifestyle. And because the plan includes a good amount of processed foods, there may be health concerns for some people.\r\n\r\nBreaking Down the Noom Diet\r\n\r\nAlthough newer on the scene than other tried-and-true plans, Noom is used by nearly 50 million people worldwide. The app-based program aims to educate members on how to make healthier choices (no foods are off-limits) and help them implement small, sustainable lifestyle changes that will result in long-term weight loss and maintenance.\r\n\r\nThe catch? It's not a quick-fix kind of diet, and plans run on the pricier side. So members must be ready and willing to put in the work (and cash) to see success.",
    "author": "By Kaitlin Ahern",
    "created_at": "2021-04-15T14:51:29.004Z",
    "owner": 1
  }
},
{
  "model": "articles.article",
  "pk": 6,
  "fields": {
    "name": "5 Foods That Fuel Your Body",
    "image": [
      "https://img.livestrong.com/640/clsd/getty/cache.gettyimages.com/ccaf3cc8c7de4797b972440b7049c0a1.jpg",
      "https://img.livestrong.com/640/clsd/getty/cache.gettyimages.com/7f781750a4e940d2abf75817ae5a6f74.jpg",
      "https://img.livestrong.com/640/clsd/getty/cache.gettyimages.com/dafb99c8cf9a4adc8f09d4c4b86aeaf1.jpg",
      "https://img.livestrong.com/640/clsd/getty/cache.gettyimages.com/2b254d38c49346b1aec914a95d8a27f8.jpg",
      "https://img.livestrong.com/640/clsd/getty/cache.gettyimages.com/39beb969e8864c418fa282d7ae459704.jpg",
      "https://img.livestrong.com/640/clsd/getty/cache.gettyimages.com/b5432810a727441ab147b4c3b5b6e2fb.jpg"
    ],
    "text": "Overview\r\n\r\nA good diet doesn't rely on restricting what you eat. Instead, it focuses on consuming more of the right foods for your body. Try adding these options to your daily meals, and you'll improve your body and never feel hungry again.\r\n\r\nConsider protein the building block of any good eating plan. Whether you prefer meat, chicken, fish, eggs, dairy or soy, make sure you include protein in each meal. University of Illinois researchers found that dieters who eat higher amounts of protein lose more fat and feel more satisfied than those who eat the lowest amount.\r\n\r\nResearch has discovered that consuming calcium through dairy products (like yogurt) may reduce the fat absorption of other foods, making it harder to gain weight. Just keep a close eye on how much sugar is in your favorite brand. Instead, opt for the Greek version, or stick with plain yogurt and add nuts or fruit for flavor.\r\n\r\nConsider this the ultimate dessert. Researchers at the Salk institute recently discovered that a compound found in strawberries helps your body fight against diabetes and nervous system disorders. Even better, the sweetness can trick your taste buds and help lessen your cravings for sugar.\r\n\r\nWhile almonds receive all the attention, pistachios provide just as much fiber (3 grams) and the same amount of heart healthy fats. But the extra benefit: Pistachios are one of the lowest calorie nuts, and researchers have found that the process of removing the shells helps limit over-eating.\r\n\r\nThis leafy green is a slimming food that's bursting with health benefits. It's a powerful source of folate, a B vitamin that helps with weight loss, and it contains other micronutrients that have been linked with fighting cancer, preventing Alzheimer's, and protecting your liver.",
    "author": "by ADAM BORNSTEIN",
    "created_at": "2021-04-15T14:58:22.854Z",
    "owner": 1
  }
}
]
